package com.nickolss.dijkstra;

public class Main {
    public static void main(String[] args) {
        /* Vamos criar o grafo do exemplo construído acima*/
        int grafo1[][] = new int[][]{
                {0, 4, 0, 0, 0, 0, 0, 8, 0},
                {4, 0, 8, 0, 0, 0, 0, 11, 0},
                {0, 8, 0, 7, 0, 4, 0, 0, 2},
                {0, 0, 7, 0, 9, 14, 0, 0, 0},
                {0, 0, 0, 9, 0, 10, 0, 0, 0},
                {0, 0, 4, 14, 10, 0, 2, 0, 0},
                {0, 0, 0, 0, 0, 2, 0, 1, 6},
                {8, 11, 0, 0, 0, 0, 1, 0, 7},
                {0, 0, 2, 0, 0, 0, 6, 7, 0}
        };

//        int grafo2[][] = new int[][]{
//                {0, 4, 6, 13, 0, 0, 0, 0, 0},
//                {4, 0, 2, 9, 10, 0, 0, 0, 0},
//                {6, 2, 0, 0, 7, 2, 0, 0, 0},
//                {13, 9, 0, 0, 1, 0, 0, 2, 0},
//                {0, 10, 7, 1, 0, 5, 1, 5, 0},
//                {0, 0, 2, 0, 5, 0, 0, 1, 3},
//                {0, 0, 0, 0, 1, 0, 0, 3, 1},
//                {0, 0, 0, 2, 5, 1, 3, 0, 2},
//                {0, 0, 0, 0, 0, 3, 1, 2, 0}
//        };

        ShortestPath t = new ShortestPath();
        t.dijkstra(grafo1, 0);
        //t.dijkstra(grafo2, 0);
    }
}